tap "homebrew/autoupdate"
tap "hrtshu/tap"
tap "jakehilborn/jakehilborn"
tap "teamookla/speedtest"

brew "bash"
brew "bash-completion"
brew "binutils"
brew "curl"
brew "coreutils"
brew "diffutils"
brew "direnv"
brew "jakehilborn/jakehilborn/displayplacer"
# brew "docker" # caskのDockerと競合するのでcaskのものを使う
# brew "docker-completion"
brew "dos2unix"
brew "ffmpeg"
brew "findutils"
brew "gcc"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnu-getopt"
brew "grep"
brew "iproute2mac"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "lsof"
brew "make"
brew "openssh"
brew "openssl"
brew "p7zip"
brew "python"
brew "ruby" # 一応入れるが基本はasdfのものを使う
brew "terminal-notifier"
brew "tig"
brew "tmux"
brew "tree"
brew "unar"
brew "unzip"
brew "usbutils"
brew "vim"
brew "watch"
brew "wget"
brew "whois"
brew "asdf"
brew "teamookla/speedtest/speedtest"
brew "rsync"
brew "pv"
brew "bufbuild/buf/buf"

# optional
brew "awscli"
brew "e2fsprogs"
brew "exiftool"
brew "gnupg"
brew "gnutls"
brew "gptfdisk"
brew "ipcalc"
brew "iperf3"
brew "kustomize"
brew "nmap"
brew "smartmontools"
brew "socat"
brew "sqlite"
brew "swift-format"
brew "tor"
brew "youtube-dl"

# cask
cask "arc"
cask "clipy"
cask "monitorcontrol"
cask "switchresx"
cask "google-chrome"
# cask "lastpass"
cask "visual-studio-code"
cask "alacritty"
cask "slack"
cask "zoom"
cask "windows-app"
cask "postman"
cask "altair-graphql-client"
cask "mysqlworkbench"
# cask "docker"
cask "orbstack"
cask "android-studio"
cask "microsoft-excel"
cask "microsoft-word"
cask "microsoft-powerpoint"
cask "microsoft-edge"
cask "keepassxc"
cask "wireshark"
cask "google-drive"
cask "onedrive"
cask "hhkb-studio"
cask "popclip"

# mas
mas "Speedtest by Ookla", id: 1153157709
mas "AS Timer", id: 512464723
mas "Battery Monitor: Health, Info", id: 836505650
mas "Stickies - Sticky notes app", id: 1572061218
mas "Magnet", id: 441258766

# my tools
brew "hrtshu/tap/window-placer"
cask "hrtshu/tap/focus-sidebar"
