bash
bash-completion
binutils
curl
coreutils
diffutils
docker
docker-completion
dos2unix
ffmpeg
findutils
gcc
git
gnu-sed
gnu-tar
gnu-time
gnu-which
grep
iproute2mac
jq
kubernetes-cli
make
openssh
openssl
python
ruby
terminal-notifier
tig
tmux
tree
unar
unzip
vim
watch
wget
whois